Revit 2024 API
MEPCalculationServerInfo Constructor (MEPCalculationServerInfo)
 Constructs a new copy of the input MEPCalculationServerInfo object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public MEPCalculationServerInfo(
	MEPCalculationServerInfo other
)
Visual Basic
Public Sub New ( _
	other As MEPCalculationServerInfo _
)
Visual C++
public:
MEPCalculationServerInfo(
	MEPCalculationServerInfo^ other
)
Parameters
other
Type: Autodesk.Revit.DB.MEPCalculationServerInfo
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
MEPCalculationServerInfo Class
MEPCalculationServerInfo Overload
Autodesk.Revit.DB Namespace